; domain
(define (domain hanoi)
	(:requirements :strips)
	(:types )
	(:constants )
	(:predicates
		(split )
		(unsplit )
		(g0_done___ )
		(g0_clear ?x)
		(g0_on ?x ?y)
		(g0_smaller ?x ?y)
	)
(:action do-split
	:parameters ()
	:precondition (and (unsplit ))
	:effect (and (not (unsplit )) (split ))
)
(:action mark-done-g0
	:parameters ()
	:precondition (and (split ) (g0_on d7 peg3) (g0_on d6 d7) (g0_on d5 d6) (g0_on d4 d5) (g0_on d3 d4) (g0_on d2 d3) (g0_on d1 d2))
	:effect (and (g0_done___ ))
)
(:action gGLOBAL_move
	:parameters (?disc ?from ?to)
	:precondition (and (unsplit ) (g0_smaller ?to ?disc) (g0_on ?disc ?from) (g0_clear ?disc) (g0_clear ?to))
	:effect (and (g0_clear ?from) (g0_on ?disc ?to) (not (g0_on ?disc ?from)) (not (g0_clear ?to)) (increase (total-cost ) 1))
)
(:action g0_move
	:parameters (?disc ?from ?to)
	:precondition (and (g0_smaller ?to ?disc) (g0_on ?disc ?from) (g0_clear ?disc) (g0_clear ?to) (split ))
	:effect (and (g0_clear ?from) (g0_on ?disc ?to) (not (g0_on ?disc ?from)) (not (g0_clear ?to)))
)
)

; problem
(define (problem hanoi-7)
	(:domain hanoi)
	(:objects peg1 peg2 peg3 d1 d2 d3 d4 d5 d6 d7)
	(:init 
		(unsplit )
		(g0_smaller peg1 d1)
		(g0_smaller peg1 d2)
		(g0_smaller peg1 d3)
		(g0_smaller peg1 d4)
		(g0_smaller peg1 d5)
		(g0_smaller peg1 d6)
		(g0_smaller peg1 d7)
		(g0_smaller peg2 d1)
		(g0_smaller peg2 d2)
		(g0_smaller peg2 d3)
		(g0_smaller peg2 d4)
		(g0_smaller peg2 d5)
		(g0_smaller peg2 d6)
		(g0_smaller peg2 d7)
		(g0_smaller peg3 d1)
		(g0_smaller peg3 d2)
		(g0_smaller peg3 d3)
		(g0_smaller peg3 d4)
		(g0_smaller peg3 d5)
		(g0_smaller peg3 d6)
		(g0_smaller peg3 d7)
		(g0_smaller d1 d1)
		(g0_smaller d2 d1)
		(g0_smaller d3 d1)
		(g0_smaller d4 d1)
		(g0_smaller d5 d1)
		(g0_smaller d6 d1)
		(g0_smaller d7 d1)
		(g0_smaller d2 d2)
		(g0_smaller d3 d2)
		(g0_smaller d4 d2)
		(g0_smaller d5 d2)
		(g0_smaller d6 d2)
		(g0_smaller d7 d2)
		(g0_smaller d3 d3)
		(g0_smaller d4 d3)
		(g0_smaller d5 d3)
		(g0_smaller d6 d3)
		(g0_smaller d7 d3)
		(g0_smaller d4 d4)
		(g0_smaller d5 d4)
		(g0_smaller d6 d4)
		(g0_smaller d7 d4)
		(g0_smaller d5 d5)
		(g0_smaller d6 d5)
		(g0_smaller d7 d5)
		(g0_smaller d6 d6)
		(g0_smaller d7 d6)
		(g0_clear peg2)
		(g0_clear peg3)
		(g0_clear d1)
		(g0_on d7 peg1)
		(g0_on d6 d7)
		(g0_on d5 d6)
		(g0_on d4 d5)
		(g0_on d3 d4)
		(g0_on d2 d3)
		(g0_on d1 d2)
	)
	(:goal (and (g0_on d7 peg3) (g0_on d6 d7) (g0_on d5 d6) (g0_on d4 d5) (g0_on d3 d4) (g0_on d2 d3) (g0_on d1 d2)))
)

; plan
1. (gglobal_move d1 d2 peg3)
   deleted: (g0_on d1 d2) (g0_clear peg3)
   added: (g0_clear d2) (g0_on d1 peg3)
   goals met: 5 of 7
2. (gglobal_move d2 d3 peg2)
   deleted: (g0_on d2 d3) (g0_clear peg2)
   added: (g0_clear d3) (g0_on d2 peg2)
   goals met: 4 of 7
3. (gglobal_move d1 peg3 d2)
   deleted: (g0_on d1 peg3) (g0_clear d2)
   added: (g0_clear peg3) (g0_on d1 d2)
   goals met: 5 of 7
4. (gglobal_move d3 d4 peg3)
   deleted: (g0_on d3 d4) (g0_clear peg3)
   added: (g0_clear d4) (g0_on d3 peg3)
   goals met: 4 of 7
5. (gglobal_move d1 d2 d4)
   deleted: (g0_on d1 d2) (g0_clear d4)
   added: (g0_clear d2) (g0_on d1 d4)
   goals met: 3 of 7
6. (gglobal_move d2 peg2 d3)
   deleted: (g0_on d2 peg2) (g0_clear d3)
   added: (g0_clear peg2) (g0_on d2 d3)
   goals met: 4 of 7
7. (gglobal_move d1 d4 d2)
   deleted: (g0_on d1 d4) (g0_clear d2)
   added: (g0_clear d4) (g0_on d1 d2)
   goals met: 5 of 7
8. (gglobal_move d4 d5 peg2)
   deleted: (g0_on d4 d5) (g0_clear peg2)
   added: (g0_clear d5) (g0_on d4 peg2)
   goals met: 4 of 7
9. (gglobal_move d1 d2 d4)
   deleted: (g0_on d1 d2) (g0_clear d4)
   added: (g0_clear d2) (g0_on d1 d4)
   goals met: 3 of 7
10. (gglobal_move d2 d3 d5)
   deleted: (g0_on d2 d3) (g0_clear d5)
   added: (g0_clear d3) (g0_on d2 d5)
   goals met: 2 of 7
11. (gglobal_move d1 d4 d2)
   deleted: (g0_on d1 d4) (g0_clear d2)
   added: (g0_clear d4) (g0_on d1 d2)
   goals met: 3 of 7
12. (gglobal_move d3 peg3 d4)
   deleted: (g0_on d3 peg3) (g0_clear d4)
   added: (g0_clear peg3) (g0_on d3 d4)
   goals met: 4 of 7
13. (gglobal_move d1 d2 peg3)
   deleted: (g0_on d1 d2) (g0_clear peg3)
   added: (g0_clear d2) (g0_on d1 peg3)
   goals met: 3 of 7
14. (gglobal_move d2 d5 d3)
   deleted: (g0_on d2 d5) (g0_clear d3)
   added: (g0_clear d5) (g0_on d2 d3)
   goals met: 4 of 7
15. (gglobal_move d1 peg3 d2)
   deleted: (g0_on d1 peg3) (g0_clear d2)
   added: (g0_clear peg3) (g0_on d1 d2)
   goals met: 5 of 7
16. (gglobal_move d5 d6 peg3)
   deleted: (g0_on d5 d6) (g0_clear peg3)
   added: (g0_clear d6) (g0_on d5 peg3)
   goals met: 4 of 7
17. (gglobal_move d1 d2 d6)
   deleted: (g0_on d1 d2) (g0_clear d6)
   added: (g0_clear d2) (g0_on d1 d6)
   goals met: 3 of 7
18. (gglobal_move d2 d3 d5)
   deleted: (g0_on d2 d3) (g0_clear d5)
   added: (g0_clear d3) (g0_on d2 d5)
   goals met: 2 of 7
19. (gglobal_move d1 d6 d2)
   deleted: (g0_on d1 d6) (g0_clear d2)
   added: (g0_clear d6) (g0_on d1 d2)
   goals met: 3 of 7
20. (gglobal_move d3 d4 d6)
   deleted: (g0_on d3 d4) (g0_clear d6)
   added: (g0_clear d4) (g0_on d3 d6)
   goals met: 2 of 7
21. (gglobal_move d1 d2 d4)
   deleted: (g0_on d1 d2) (g0_clear d4)
   added: (g0_clear d2) (g0_on d1 d4)
   goals met: 1 of 7
22. (gglobal_move d2 d5 d3)
   deleted: (g0_on d2 d5) (g0_clear d3)
   added: (g0_clear d5) (g0_on d2 d3)
   goals met: 2 of 7
23. (gglobal_move d1 d4 d2)
   deleted: (g0_on d1 d4) (g0_clear d2)
   added: (g0_clear d4) (g0_on d1 d2)
   goals met: 3 of 7
24. (gglobal_move d4 peg2 d5)
   deleted: (g0_on d4 peg2) (g0_clear d5)
   added: (g0_clear peg2) (g0_on d4 d5)
   goals met: 4 of 7
25. (gglobal_move d1 d2 d4)
   deleted: (g0_on d1 d2) (g0_clear d4)
   added: (g0_clear d2) (g0_on d1 d4)
   goals met: 3 of 7
26. (gglobal_move d2 d3 peg2)
   deleted: (g0_on d2 d3) (g0_clear peg2)
   added: (g0_clear d3) (g0_on d2 peg2)
   goals met: 2 of 7
27. (gglobal_move d1 d4 d2)
   deleted: (g0_on d1 d4) (g0_clear d2)
   added: (g0_clear d4) (g0_on d1 d2)
   goals met: 3 of 7
28. (gglobal_move d3 d6 d4)
   deleted: (g0_on d3 d6) (g0_clear d4)
   added: (g0_clear d6) (g0_on d3 d4)
   goals met: 4 of 7
29. (gglobal_move d1 d2 d6)
   deleted: (g0_on d1 d2) (g0_clear d6)
   added: (g0_clear d2) (g0_on d1 d6)
   goals met: 3 of 7
30. (gglobal_move d2 peg2 d3)
   deleted: (g0_on d2 peg2) (g0_clear d3)
   added: (g0_clear peg2) (g0_on d2 d3)
   goals met: 4 of 7
31. (gglobal_move d1 d6 d2)
   deleted: (g0_on d1 d6) (g0_clear d2)
   added: (g0_clear d6) (g0_on d1 d2)
   goals met: 5 of 7
32. (gglobal_move d6 d7 peg2)
   deleted: (g0_on d6 d7) (g0_clear peg2)
   added: (g0_clear d7) (g0_on d6 peg2)
   goals met: 4 of 7
33. (gglobal_move d1 d2 d6)
   deleted: (g0_on d1 d2) (g0_clear d6)
   added: (g0_clear d2) (g0_on d1 d6)
   goals met: 3 of 7
34. (gglobal_move d2 d3 d7)
   deleted: (g0_on d2 d3) (g0_clear d7)
   added: (g0_clear d3) (g0_on d2 d7)
   goals met: 2 of 7
35. (gglobal_move d1 d6 d2)
   deleted: (g0_on d1 d6) (g0_clear d2)
   added: (g0_clear d6) (g0_on d1 d2)
   goals met: 3 of 7
36. (gglobal_move d3 d4 d6)
   deleted: (g0_on d3 d4) (g0_clear d6)
   added: (g0_clear d4) (g0_on d3 d6)
   goals met: 2 of 7
37. (gglobal_move d1 d2 d4)
   deleted: (g0_on d1 d2) (g0_clear d4)
   added: (g0_clear d2) (g0_on d1 d4)
   goals met: 1 of 7
38. (gglobal_move d2 d7 d3)
   deleted: (g0_on d2 d7) (g0_clear d3)
   added: (g0_clear d7) (g0_on d2 d3)
   goals met: 2 of 7
39. (gglobal_move d1 d4 d2)
   deleted: (g0_on d1 d4) (g0_clear d2)
   added: (g0_clear d4) (g0_on d1 d2)
   goals met: 3 of 7
40. (gglobal_move d4 d5 d7)
   deleted: (g0_on d4 d5) (g0_clear d7)
   added: (g0_clear d5) (g0_on d4 d7)
   goals met: 2 of 7
41. (gglobal_move d1 d2 d4)
   deleted: (g0_on d1 d2) (g0_clear d4)
   added: (g0_clear d2) (g0_on d1 d4)
   goals met: 1 of 7
42. (gglobal_move d2 d3 d5)
   deleted: (g0_on d2 d3) (g0_clear d5)
   added: (g0_clear d3) (g0_on d2 d5)
   goals met: 0 of 7
43. (gglobal_move d1 d4 d2)
   deleted: (g0_on d1 d4) (g0_clear d2)
   added: (g0_clear d4) (g0_on d1 d2)
   goals met: 1 of 7
44. (gglobal_move d3 d6 d4)
   deleted: (g0_on d3 d6) (g0_clear d4)
   added: (g0_clear d6) (g0_on d3 d4)
   goals met: 2 of 7
45. (gglobal_move d1 d2 d6)
   deleted: (g0_on d1 d2) (g0_clear d6)
   added: (g0_clear d2) (g0_on d1 d6)
   goals met: 1 of 7
46. (gglobal_move d2 d5 d3)
   deleted: (g0_on d2 d5) (g0_clear d3)
   added: (g0_clear d5) (g0_on d2 d3)
   goals met: 2 of 7
47. (gglobal_move d1 d6 d2)
   deleted: (g0_on d1 d6) (g0_clear d2)
   added: (g0_clear d6) (g0_on d1 d2)
   goals met: 3 of 7
48. (gglobal_move d5 peg3 d6)
   deleted: (g0_on d5 peg3) (g0_clear d6)
   added: (g0_clear peg3) (g0_on d5 d6)
   goals met: 4 of 7
49. (gglobal_move d1 d2 peg3)
   deleted: (g0_on d1 d2) (g0_clear peg3)
   added: (g0_clear d2) (g0_on d1 peg3)
   goals met: 3 of 7
50. (gglobal_move d2 d3 d5)
   deleted: (g0_on d2 d3) (g0_clear d5)
   added: (g0_clear d3) (g0_on d2 d5)
   goals met: 2 of 7
51. (gglobal_move d1 peg3 d2)
   deleted: (g0_on d1 peg3) (g0_clear d2)
   added: (g0_clear peg3) (g0_on d1 d2)
   goals met: 3 of 7
52. (gglobal_move d3 d4 peg3)
   deleted: (g0_on d3 d4) (g0_clear peg3)
   added: (g0_clear d4) (g0_on d3 peg3)
   goals met: 2 of 7
53. (gglobal_move d1 d2 d4)
   deleted: (g0_on d1 d2) (g0_clear d4)
   added: (g0_clear d2) (g0_on d1 d4)
   goals met: 1 of 7
54. (gglobal_move d2 d5 d3)
   deleted: (g0_on d2 d5) (g0_clear d3)
   added: (g0_clear d5) (g0_on d2 d3)
   goals met: 2 of 7
55. (gglobal_move d1 d4 d2)
   deleted: (g0_on d1 d4) (g0_clear d2)
   added: (g0_clear d4) (g0_on d1 d2)
   goals met: 3 of 7
56. (gglobal_move d4 d7 d5)
   deleted: (g0_on d4 d7) (g0_clear d5)
   added: (g0_clear d7) (g0_on d4 d5)
   goals met: 4 of 7
57. (gglobal_move d1 d2 d4)
   deleted: (g0_on d1 d2) (g0_clear d4)
   added: (g0_clear d2) (g0_on d1 d4)
   goals met: 3 of 7
58. (gglobal_move d2 d3 d7)
   deleted: (g0_on d2 d3) (g0_clear d7)
   added: (g0_clear d3) (g0_on d2 d7)
   goals met: 2 of 7
59. (gglobal_move d1 d4 d2)
   deleted: (g0_on d1 d4) (g0_clear d2)
   added: (g0_clear d4) (g0_on d1 d2)
   goals met: 3 of 7
60. (gglobal_move d3 peg3 d4)
   deleted: (g0_on d3 peg3) (g0_clear d4)
   added: (g0_clear peg3) (g0_on d3 d4)
   goals met: 4 of 7
61. (gglobal_move d1 d2 peg3)
   deleted: (g0_on d1 d2) (g0_clear peg3)
   added: (g0_clear d2) (g0_on d1 peg3)
   goals met: 3 of 7
62. (gglobal_move d2 d7 d3)
   deleted: (g0_on d2 d7) (g0_clear d3)
   added: (g0_clear d7) (g0_on d2 d3)
   goals met: 4 of 7
63. (gglobal_move d1 peg3 d2)
   deleted: (g0_on d1 peg3) (g0_clear d2)
   added: (g0_clear peg3) (g0_on d1 d2)
   goals met: 5 of 7
64. (gglobal_move d7 peg1 peg3)
   deleted: (g0_on d7 peg1) (g0_clear peg3)
   added: (g0_clear peg1) (g0_on d7 peg3)
   goals met: 6 of 7
65. (gglobal_move d1 d2 peg1)
   deleted: (g0_on d1 d2) (g0_clear peg1)
   added: (g0_clear d2) (g0_on d1 peg1)
   goals met: 5 of 7
66. (gglobal_move d2 d3 d7)
   deleted: (g0_on d2 d3) (g0_clear d7)
   added: (g0_clear d3) (g0_on d2 d7)
   goals met: 4 of 7
67. (gglobal_move d1 peg1 d2)
   deleted: (g0_on d1 peg1) (g0_clear d2)
   added: (g0_clear peg1) (g0_on d1 d2)
   goals met: 5 of 7
68. (gglobal_move d3 d4 peg1)
   deleted: (g0_on d3 d4) (g0_clear peg1)
   added: (g0_clear d4) (g0_on d3 peg1)
   goals met: 4 of 7
69. (gglobal_move d1 d2 d4)
   deleted: (g0_on d1 d2) (g0_clear d4)
   added: (g0_clear d2) (g0_on d1 d4)
   goals met: 3 of 7
70. (gglobal_move d2 d7 d3)
   deleted: (g0_on d2 d7) (g0_clear d3)
   added: (g0_clear d7) (g0_on d2 d3)
   goals met: 4 of 7
71. (gglobal_move d1 d4 d2)
   deleted: (g0_on d1 d4) (g0_clear d2)
   added: (g0_clear d4) (g0_on d1 d2)
   goals met: 5 of 7
72. (gglobal_move d4 d5 d7)
   deleted: (g0_on d4 d5) (g0_clear d7)
   added: (g0_clear d5) (g0_on d4 d7)
   goals met: 4 of 7
73. (gglobal_move d1 d2 d4)
   deleted: (g0_on d1 d2) (g0_clear d4)
   added: (g0_clear d2) (g0_on d1 d4)
   goals met: 3 of 7
74. (gglobal_move d2 d3 d5)
   deleted: (g0_on d2 d3) (g0_clear d5)
   added: (g0_clear d3) (g0_on d2 d5)
   goals met: 2 of 7
75. (gglobal_move d1 d4 d2)
   deleted: (g0_on d1 d4) (g0_clear d2)
   added: (g0_clear d4) (g0_on d1 d2)
   goals met: 3 of 7
76. (gglobal_move d3 peg1 d4)
   deleted: (g0_on d3 peg1) (g0_clear d4)
   added: (g0_clear peg1) (g0_on d3 d4)
   goals met: 4 of 7
77. (gglobal_move d1 d2 peg1)
   deleted: (g0_on d1 d2) (g0_clear peg1)
   added: (g0_clear d2) (g0_on d1 peg1)
   goals met: 3 of 7
78. (gglobal_move d2 d5 d3)
   deleted: (g0_on d2 d5) (g0_clear d3)
   added: (g0_clear d5) (g0_on d2 d3)
   goals met: 4 of 7
79. (gglobal_move d1 peg1 d2)
   deleted: (g0_on d1 peg1) (g0_clear d2)
   added: (g0_clear peg1) (g0_on d1 d2)
   goals met: 5 of 7
80. (gglobal_move d5 d6 peg1)
   deleted: (g0_on d5 d6) (g0_clear peg1)
   added: (g0_clear d6) (g0_on d5 peg1)
   goals met: 4 of 7
81. (gglobal_move d1 d2 d6)
   deleted: (g0_on d1 d2) (g0_clear d6)
   added: (g0_clear d2) (g0_on d1 d6)
   goals met: 3 of 7
82. (gglobal_move d2 d3 d5)
   deleted: (g0_on d2 d3) (g0_clear d5)
   added: (g0_clear d3) (g0_on d2 d5)
   goals met: 2 of 7
83. (gglobal_move d1 d6 d2)
   deleted: (g0_on d1 d6) (g0_clear d2)
   added: (g0_clear d6) (g0_on d1 d2)
   goals met: 3 of 7
84. (gglobal_move d3 d4 d6)
   deleted: (g0_on d3 d4) (g0_clear d6)
   added: (g0_clear d4) (g0_on d3 d6)
   goals met: 2 of 7
85. (gglobal_move d1 d2 d4)
   deleted: (g0_on d1 d2) (g0_clear d4)
   added: (g0_clear d2) (g0_on d1 d4)
   goals met: 1 of 7
86. (gglobal_move d2 d5 d3)
   deleted: (g0_on d2 d5) (g0_clear d3)
   added: (g0_clear d5) (g0_on d2 d3)
   goals met: 2 of 7
87. (gglobal_move d1 d4 d2)
   deleted: (g0_on d1 d4) (g0_clear d2)
   added: (g0_clear d4) (g0_on d1 d2)
   goals met: 3 of 7
88. (gglobal_move d4 d7 d5)
   deleted: (g0_on d4 d7) (g0_clear d5)
   added: (g0_clear d7) (g0_on d4 d5)
   goals met: 4 of 7
89. (gglobal_move d1 d2 d4)
   deleted: (g0_on d1 d2) (g0_clear d4)
   added: (g0_clear d2) (g0_on d1 d4)
   goals met: 3 of 7
90. (gglobal_move d2 d3 d7)
   deleted: (g0_on d2 d3) (g0_clear d7)
   added: (g0_clear d3) (g0_on d2 d7)
   goals met: 2 of 7
91. (gglobal_move d1 d4 d2)
   deleted: (g0_on d1 d4) (g0_clear d2)
   added: (g0_clear d4) (g0_on d1 d2)
   goals met: 3 of 7
92. (gglobal_move d3 d6 d4)
   deleted: (g0_on d3 d6) (g0_clear d4)
   added: (g0_clear d6) (g0_on d3 d4)
   goals met: 4 of 7
93. (gglobal_move d1 d2 d6)
   deleted: (g0_on d1 d2) (g0_clear d6)
   added: (g0_clear d2) (g0_on d1 d6)
   goals met: 3 of 7
94. (gglobal_move d2 d7 d3)
   deleted: (g0_on d2 d7) (g0_clear d3)
   added: (g0_clear d7) (g0_on d2 d3)
   goals met: 4 of 7
95. (gglobal_move d1 d6 d2)
   deleted: (g0_on d1 d6) (g0_clear d2)
   added: (g0_clear d6) (g0_on d1 d2)
   goals met: 5 of 7
96. (gglobal_move d6 peg2 d7)
   deleted: (g0_on d6 peg2) (g0_clear d7)
   added: (g0_clear peg2) (g0_on d6 d7)
   goals met: 6 of 7
97. (gglobal_move d1 d2 d6)
   deleted: (g0_on d1 d2) (g0_clear d6)
   added: (g0_clear d2) (g0_on d1 d6)
   goals met: 5 of 7
98. (gglobal_move d2 d3 peg2)
   deleted: (g0_on d2 d3) (g0_clear peg2)
   added: (g0_clear d3) (g0_on d2 peg2)
   goals met: 4 of 7
99. (gglobal_move d1 d6 d2)
   deleted: (g0_on d1 d6) (g0_clear d2)
   added: (g0_clear d6) (g0_on d1 d2)
   goals met: 5 of 7
100. (gglobal_move d3 d4 d6)
   deleted: (g0_on d3 d4) (g0_clear d6)
   added: (g0_clear d4) (g0_on d3 d6)
   goals met: 4 of 7
101. (gglobal_move d1 d2 d4)
   deleted: (g0_on d1 d2) (g0_clear d4)
   added: (g0_clear d2) (g0_on d1 d4)
   goals met: 3 of 7
102. (gglobal_move d2 peg2 d3)
   deleted: (g0_on d2 peg2) (g0_clear d3)
   added: (g0_clear peg2) (g0_on d2 d3)
   goals met: 4 of 7
103. (gglobal_move d1 d4 d2)
   deleted: (g0_on d1 d4) (g0_clear d2)
   added: (g0_clear d4) (g0_on d1 d2)
   goals met: 5 of 7
104. (gglobal_move d4 d5 peg2)
   deleted: (g0_on d4 d5) (g0_clear peg2)
   added: (g0_clear d5) (g0_on d4 peg2)
   goals met: 4 of 7
105. (gglobal_move d1 d2 d4)
   deleted: (g0_on d1 d2) (g0_clear d4)
   added: (g0_clear d2) (g0_on d1 d4)
   goals met: 3 of 7
106. (gglobal_move d2 d3 d5)
   deleted: (g0_on d2 d3) (g0_clear d5)
   added: (g0_clear d3) (g0_on d2 d5)
   goals met: 2 of 7
107. (gglobal_move d1 d4 d2)
   deleted: (g0_on d1 d4) (g0_clear d2)
   added: (g0_clear d4) (g0_on d1 d2)
   goals met: 3 of 7
108. (gglobal_move d3 d6 d4)
   deleted: (g0_on d3 d6) (g0_clear d4)
   added: (g0_clear d6) (g0_on d3 d4)
   goals met: 4 of 7
109. (gglobal_move d1 d2 d6)
   deleted: (g0_on d1 d2) (g0_clear d6)
   added: (g0_clear d2) (g0_on d1 d6)
   goals met: 3 of 7
110. (gglobal_move d2 d5 d3)
   deleted: (g0_on d2 d5) (g0_clear d3)
   added: (g0_clear d5) (g0_on d2 d3)
   goals met: 4 of 7
111. (gglobal_move d1 d6 d2)
   deleted: (g0_on d1 d6) (g0_clear d2)
   added: (g0_clear d6) (g0_on d1 d2)
   goals met: 5 of 7
112. (gglobal_move d5 peg1 d6)
   deleted: (g0_on d5 peg1) (g0_clear d6)
   added: (g0_clear peg1) (g0_on d5 d6)
   goals met: 6 of 7
113. (gglobal_move d1 d2 peg1)
   deleted: (g0_on d1 d2) (g0_clear peg1)
   added: (g0_clear d2) (g0_on d1 peg1)
   goals met: 5 of 7
114. (gglobal_move d2 d3 d5)
   deleted: (g0_on d2 d3) (g0_clear d5)
   added: (g0_clear d3) (g0_on d2 d5)
   goals met: 4 of 7
115. (gglobal_move d1 peg1 d2)
   deleted: (g0_on d1 peg1) (g0_clear d2)
   added: (g0_clear peg1) (g0_on d1 d2)
   goals met: 5 of 7
116. (gglobal_move d3 d4 peg1)
   deleted: (g0_on d3 d4) (g0_clear peg1)
   added: (g0_clear d4) (g0_on d3 peg1)
   goals met: 4 of 7
117. (gglobal_move d1 d2 d4)
   deleted: (g0_on d1 d2) (g0_clear d4)
   added: (g0_clear d2) (g0_on d1 d4)
   goals met: 3 of 7
118. (gglobal_move d2 d5 d3)
   deleted: (g0_on d2 d5) (g0_clear d3)
   added: (g0_clear d5) (g0_on d2 d3)
   goals met: 4 of 7
119. (gglobal_move d1 d4 d2)
   deleted: (g0_on d1 d4) (g0_clear d2)
   added: (g0_clear d4) (g0_on d1 d2)
   goals met: 5 of 7
120. (gglobal_move d4 peg2 d5)
   deleted: (g0_on d4 peg2) (g0_clear d5)
   added: (g0_clear peg2) (g0_on d4 d5)
   goals met: 6 of 7
121. (gglobal_move d1 d2 d4)
   deleted: (g0_on d1 d2) (g0_clear d4)
   added: (g0_clear d2) (g0_on d1 d4)
   goals met: 5 of 7
122. (gglobal_move d2 d3 peg2)
   deleted: (g0_on d2 d3) (g0_clear peg2)
   added: (g0_clear d3) (g0_on d2 peg2)
   goals met: 4 of 7
123. (gglobal_move d1 d4 d2)
   deleted: (g0_on d1 d4) (g0_clear d2)
   added: (g0_clear d4) (g0_on d1 d2)
   goals met: 5 of 7
124. (gglobal_move d3 peg1 d4)
   deleted: (g0_on d3 peg1) (g0_clear d4)
   added: (g0_clear peg1) (g0_on d3 d4)
   goals met: 6 of 7
125. (gglobal_move d1 d2 peg1)
   deleted: (g0_on d1 d2) (g0_clear peg1)
   added: (g0_clear d2) (g0_on d1 peg1)
   goals met: 5 of 7
126. (gglobal_move d2 peg2 d3)
   deleted: (g0_on d2 peg2) (g0_clear d3)
   added: (g0_clear peg2) (g0_on d2 d3)
   goals met: 6 of 7
127. (gglobal_move d1 peg1 d2)
   deleted: (g0_on d1 peg1) (g0_clear d2)
   added: (g0_clear peg1) (g0_on d1 d2)
   goals met: 7 of 7
